{
    "projects": {
        "column_names": ["name", "overview", "thumbnail", "languages", "goal", "client", "view", "website", "repo", "tech", "story"],
        "name": "projects",
        "elements": [{
            "name": "ProfileWords",
            "overview": "Identity analysis via twitter. Using follower data to explore the personality of Twitter accounts in a visual way.",
            "thumbnail": "profilewords.png",
            "languages": "HTML5",
            "goal": "An insightful, and easy way to find out more about the followers of a given twitter user. Wanted to understand why people followed - what was common to the followers. Wanted to learn how to enliven that data. More ideas and visualizations to come.",
            "client": "A personal project",
            "view": "profile.png",
            "website": "http://www.profilewords.com",
            "repo": "https://hub.jazz.net/project/antonm/profiles/overview",
            "tech": "* HTML5\n* Node.js\n* BlueMix\n* D3\n* Mongo Database\n* Twitter API\n* IBM Cloud",
            "story": "Twitter fascinates the heck out of me. I think the thing that I find most intriguing right now is what unitess the followers of a given twitter user - in particular for my research in designing and using what I work on in my day job.\n\nThis is a new project that I've just started working on, and I have a mental model of what it is that I'm looking for and a few sketches - but really I'm only just starting work on it.\n\nThis is also my first serious Node.js app, running on IBM's BlueMix",
            "rowNumber": 1
        }, {
            "name": "Cardinals",
            "overview": "A responsive web app experiment to find out more about the cardinals in the conclave - candidates to be the new Pope.",
            "thumbnail": "cardinals.png",
            "languages": "HTML5",
            "goal": "To plot the cardinals on the map in a clean, simple and interesting way. \n\nTo understand where the cardinals lived, to use Twitter to find out what people were saying about them. \n\nTo have a geographical way of learning about the next leader of the Catholic Church.",
            "client": "A personal project",
            "view": "cardinals.png",
            "website": "http://www.hickory.ca/cardinals/",
            "repo": "https://github.com/antonmc/sheetmap",
            "tech": "* HTML5\n* Google Maps API\n* Google Data API",
            "story": "During the election of the last pope, I was interested to know where all the cardinals came from - to understand where the next pope could come from. I couldn't find a map anywhere to show me the information.\n\nI used this experiment as a way to introduce programming to my early teenage son. He researched the candidates and built up a spreadsheet, geo-coded the coordinates and helped program the map.\n\nWe worked to seed the url of the map in comments about the papal election, and gor over 1000 hits in the first couple of days - each hit spending an average of 3 minutes on the page - poking around. It still gets hits. \n\nIt took 3 hours for us to develop, when we had the data. Again this app is fueled by a Google Spreadsheet.",
            "rowNumber": 2
        }, {
            "name": "TimeLine",
            "overview": "An interactive visual timeline experiment.",
            "thumbnail": "timeline.png",
            "languages": "HTML5",
            "goal": "To create a touch ready timeline that was responsive, clear and essential.\n\nI'd fallen for Visio timelines when I was managing projects. I wanted to learn HTML 5 Canvas, so I created this mostly in one day at a hackathon.\n\nI still dream of having a working, iPad version of this.",
            "client": "A personal project",
            "view": "clockplot.png",
            "website": "",
            "repo": "https://code.google.com/p/eventline/",
            "tech": "* HTML5 Canvas \n* Google Cloud",
            "story": "This was a project for a hackathon, where the goal was to learn more about HTML5. I chose to learn HTML5 Canvas, which later helped me in my work at IBM.\n\nMy vision for this app was to be able to take any time based data source and show it on an interactive timeline as a way of researching, searching etc. So make a youtube search that way, an email search or Twitter search. I'd still love to be able to do this. \n\nI think this project also wraps up a lot of my own design aspirations - to make the timeline be almost everything - very little user interface around it - clean and fuss free.\n\nOne day I'll come back to this ... that's what I keep telling myself ;)",
            "rowNumber": 3
        }, {
            "name": "ShelterBox",
            "overview": "A mobile app to tell the story of world crisis through acts of response to them",
            "thumbnail": "shelterbox.png",
            "languages": "iOS8",
            "goal": "The design goal was to imagine a fresh, mobile and connected way to recount the news of global crisis events ( earthquakes, tsunamis, conflict etc ).\n\nThis meant creating a server for the data, as well as the iOS client software. It required a lot of focus to learn how to make iOS apps, as well as to learn how to serve the data well, and groom the data.",
            "client": "ShelterBox",
            "view": "shelterbox.png",
            "website": "http://www.hickory.ca/pages/shelterbox.html",
            "repo": "https://hub.jazz.net/project/antonm/sbclient/overview",
            "tech": "* iOS Storyboards, Autoflow\n* iOS Core Data\n* iOS MapKit\n* Node.js\n* Twitter API \n* IBM Cloud API\n* Wikipedia\n",
            "story": "A labour of love, and one of the things that I'm proudest of in my life. \n\nThis is ultimately what I would do with my time if I was independently wealthy - I would research, design and develop software solutions that disect, prize apart and present data stories of crisis responses from the different points of view.",
            "rowNumber": 4
        }, {
            "name": "TeamBuilder",
            "overview": "A working machine learning experiment to organize community soccer teams. It didn't start out that way - but the idea took control. ",
            "thumbnail": "teambuilder.png",
            "languages": "Adobe Flex",
            "goal": "To automate the organization of community soccer for kids in a city.\n\nTo ease the process of finding a nearby team for young children to play on each season. I wanted to use algorithms for gathering kids near each other to form teams. \n\nWhen I was little this happened organically. These days, everything needs organizing - but this experiment really gave me a glimpse into the potential for data to give back.",
            "client": "Kanata Soccer",
            "view": "teambuilder.png",
            "website": "http://squadbuilder.appspot.com/",
            "repo": "",
            "tech": "* Adobe Flex \n* Google App Engine\n* Google Maps API\n* Google Data API",
            "story": "When my sons were little I was involved in the local soccer club, coaching and convening. Each season we would take hundreds of registrants and find teams for them.\n\nIt was time consuming to manually see where the soccer players lived, their skill levels etc and group them in nearby appropriate teams.\n\nThe soccer club sent excel spreadsheets with the kids information. I imported them into Google docs, then used Google APIs to pull the data into a program that plotted the kids on a map, and ran an algorithm on them to sort them into teams.\n\nThis turned a 4 hour job into a 1 minute job. \n\nThe exciting thing for me ( which we never did ) was the idea that we could have completely made this be self organizing. Teams could have begun assembling themself at registration time - each time a registrant is added, the algorithm could run - at any day we could see a bunch of teams that could meet.\n\nWhich is the way I hope things turn out in the internet of things. ",
            "rowNumber": 5
        }, {
            "name": "Icons",
            "overview": "A project to develop font icons and add them to the Orion Web IDE.",
            "thumbnail": "icons.png",
            "languages": "CSS",
            "goal": "Crisp, simple monotone font icons - with identifiable metaphors and a clear representation even at 16px. \n\nThe icons needed to work at 16px size. They needed to be a font, so that we could style them and scale them to whatever size we wanted.\n\nI use these icons for lots of projects now, and in creating wireframes.",
            "client": "IBM",
            "view": "orionfont.png",
            "website": "http://git.eclipse.org/c/orion/org.eclipse.orion.design.git/plain/icons/icons.html",
            "repo": "http://git.eclipse.org/c/orion/org.eclipse.orion.design.git/tree/icons/icons.html",
            "tech": "* Adobe Illustrator\n* Glyphs",
            "story": "When I joined the Orion project the icons were yellow on white - the contrast was not great, the style was way out of whack with the trend of monotone icons in the wider world.\n\nI was unable to affect change from the busy corporate design team to create new vector based icons for our small start-up project. The best they could do was repaint the yellow ones black and white, which was at least a step forward for us.\n\nI felt so strongly that I took training in Adobe Illustrator, drew, and redrew the icons until I felt confident that they could work, and learned how to make vector based fonts.\n\nFor the most part I did this in my spare time, and the training was at my own expense. Illustrator is my go to tool for most visual work that I do, so the training and eperience were incredibly valuable.",
            "rowNumber": 6
        }, {
            "name": "Cultura",
            "overview": "An online store for a language school",
            "thumbnail": "culturathumb.png",
            "languages": "HTML5",
            "goal": "To create a clear efficient online store for language classes, that was as easy for the owner to update as it was for a client to use.\n\nAs with many of my projects, I data drove this project from a model of the data that would be needed by the page. I used Google Spreadsheets to stroe the data and fuel the app, through a data API.\n\nIt meant the store owner only had to change the spreadsheet data to affect change on the page.",
            "client": "Cultura Espanola",
            "view": "cultura.png",
            "website": "http://www.culturaespanola.ca/store",
            "repo": "",
            "tech": "* HTML5\n* Bootstrap \n* PayPal API\n* Google Data API",
            "story": "In exchange for some Spanish lessons, I worked with the school to create a store for them. The store content is driven from Google Spreadsheets, which makes it really simple to maintain and update - no programming is needed by the school owners.\n\nHaving looked at Spanish schools for lessons, I had an idea of what I wanted to see in a website experience for finding the right lesson, the right school.\n\nI figure if the registration experience is clean, simple, and relevant, then the culture of the school will give clean, simple, relevant education.\n\nSo the system is one that I'm proud of - built around the data structure of the lessons, modeled in Google SpreadSheets. The spreadsheet creates a structure, and forces the school to think about their content - and offers a foundation of simplicity for programming using the content data.",
            "rowNumber": 7
        }, {
            "name": "JazzHub IDE",
            "overview": "How to offer a web based programming tool.",
            "thumbnail": "jazzhubthumb.png",
            "languages": "HTML5",
            "goal": "To design a lightweight, contemporary and effective code editing experience in 'the cloud'.\n\nAs time progresses I believe that we'll use web browsers to program more things. This is an ambitious project to use browsers for creating web apps and pages.",
            "client": "IBM",
            "view": "jazzhub.png",
            "website": "http://hub.jazz.net",
            "repo": "http://git.eclipse.org/c/orion/org.eclipse.orion.client.git/tree/",
            "tech": "* HTML5\n* Illustrator\n* CSS3\n* Patience ;)",
            "story": "For the past couple of years my work has focused on leading the user interface development for a web based software development tool.\n\nFor the mostpart I've implemented HTML, JS, and CSS changes, but in the past year I lead user experience - hungrily gathering feedback from users, involving them, and pushing the team for changes that they say they want. \n\nI've helped transform the IDE from a narrowly focused restful page app, to a tool that most developers would understand because it is equipped with the strucutre they're used to seeing - but at the same time, the IDE tries hard to maximize the space in the browser page, by only offering what is essential.\n\nThis IDE has been absorbed in products from HP, SAP, Pivotal, Mozilla and IBM",
            "rowNumber": 8
        }, {
            "name": "Campaigner",
            "overview": "A hackathon project with Amnesty Canada, to explore options for cheaper and more efficient campaigns",
            "thumbnail": "amnesty.png",
            "languages": "HTML5",
            "goal": "To use mobile technology to offer a gentle, inobtrusive, simple way of gathering signitures for a campaign.\n\nThis was a hackathon project - where we imagined a data driven way of managing campains for signatures.",
            "client": "Amnesty Interational",
            "view": "amnesty-screens.png",
            "website": "",
            "repo": "https://github.com/pickle27/campaigner",
            "tech": "* Ruby on Rails \n* HTML5\n* Adobe Illustrator",
            "story": "A hackathon where I was able to work with a charity that I hugely admire - Amnesty International. This was a Random Hackos Of Kindness hackathon at Shopify in Ottawa and was probably the best experience I've had a hackathon.\n\nI took a design lead role and worked a person centric design around the interested parties in a campaign - people signing, the campaign lead, the recipients, the person campaigning in the streets.\n\nWe developed this as a system - where there was a restful api for the campaign that could be used with different web and mobile front ends.\n\n",
            "rowNumber": 9
        }, {
            "name": "DesignManager",
            "overview": "A sketching tool on the web",
            "thumbnail": "dmthumb.png",
            "languages": "HTML5",
            "goal": "Wanted to easiliy allow software developers to communicate development ideas visually, by sketching comments on software designs.\n\nThis was used for reviwing design documents. I think it was a little ahead of it's time, and I wish that the technology had been used to annotate any web page - not just the images that were held in the design docs.",
            "client": "IBM",
            "view": "dm.png",
            "website": "https://jazz.net/products/design-management/",
            "repo": "",
            "tech": "* HTML5 Canvas \n* Java",
            "story": "IBM Rational Software Architect was a desktop app that allowed developers to design software systems using UML. This was a project to surface those designs on the web, and allow developers to visually comment.\n\nMy job was to design and develop the online sketching software. \n\nMy approach was to make it as incidental as possible - to allow easy discovery, but keep the drawing tools to the periphery so that the canvas was the design they were drawing on, almost like it was a window on top of the design.\n\nI developed an iPad version too, that we could use our fingers on.",
            "rowNumber": 10
        }, {
            "name": "Picker",
            "overview": "Creating a programming color scheme",
            "thumbnail": "colorpicker.png",
            "languages": "HTML5",
            "goal": "To offer an appealing, easy, visual way of building a syntax color scheme for a code editor.\n\nProgrammers like to be able to style their editors - this was my take on doing that visually.",
            "client": "IBM",
            "view": "themebuilder.png",
            "website": "http://orionhub.org",
            "repo": "http://git.eclipse.org/c/orion/org.eclipse.orion.client.git/tree/",
            "tech": "* HTML5 Canvas",
            "story": "My dream was to offer a visual snapshot of how a code editor looked, but allow a person to click on parts of it to visually change the color of different parts.\n\nIt was a nice exercise to work through - it's a tricky problem to solve - it is hard to visualize a potential color scheme if you were setting colors in a static settings form - I wanted this to be visual, and interactive.",
            "rowNumber": 11
        }, {
            "name": "OrionCover",
            "overview": "Developing a new landing page for OrionHub",
            "thumbnail": "orioncover.png",
            "languages": "HTML5",
            "goal": "Creating a simple, responating responsive cover page",
            "client": "IBM",
            "view": "hero-image.png",
            "website": "",
            "repo": "",
            "tech": "* Illustrator \n* CSS3",
            "story": "Working on this ... coming soon ...",
            "rowNumber": 12
        }],
        "raw": {
            "version": "1.0",
            "encoding": "UTF-8",
            "feed": {
                "xmlns": "http://www.w3.org/2005/Atom",
                "xmlns$openSearch": "http://a9.com/-/spec/opensearchrss/1.0/",
                "xmlns$gsx": "http://schemas.google.com/spreadsheets/2006/extended",
                "id": {
                    "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values"
                },
                "updated": {
                    "$t": "2014-11-02T23:14:54.911Z"
                },
                "category": [{
                    "scheme": "http://schemas.google.com/spreadsheets/2006",
                    "term": "http://schemas.google.com/spreadsheets/2006#list"
                }],
                "title": {
                    "type": "text",
                    "$t": "projects"
                },
                "link": [{
                    "rel": "alternate",
                    "type": "text/html",
                    "href": "https://spreadsheets.google.com/pub?key=0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc"
                }, {
                    "rel": "http://schemas.google.com/g/2005#feed",
                    "type": "application/atom+xml",
                    "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values"
                }, {
                    "rel": "self",
                    "type": "application/atom+xml",
                    "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values?alt=json-in-script&sq="
                }],
                "author": [{
                    "name": {
                        "$t": "anton.mcconville"
                    },
                    "email": {
                        "$t": "anton.mcconville@gmail.com"
                    }
                }],
                "openSearch$totalResults": {
                    "$t": "12"
                },
                "openSearch$startIndex": {
                    "$t": "1"
                },
                "entry": [{
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/b8lvi"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "ProfileWords"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: Identity analysis via twitter. Using follower data to explore the personality of Twitter accounts in a visual way., thumbnail: profilewords.png, languages: HTML5, goal: An insightful, and easy way to find out more about the followers of a given twitter user. Wanted to understand why people followed - what was common to the followers. Wanted to learn how to enliven that data. More ideas and visualizations to come., client: A personal project, view: profile.png, website: http://www.profilewords.com, repo: https://hub.jazz.net/project/antonm/profiles/overview, tech: * HTML5\n* Node.js\n* BlueMix\n* D3\n* Mongo Database\n* Twitter API\n* IBM Cloud, story: Twitter fascinates the heck out of me. I think the thing that I find most intriguing right now is what unitess the followers of a given twitter user - in particular for my research in designing and using what I work on in my day job.\n\nThis is a new project that I've just started working on, and I have a mental model of what it is that I'm looking for and a few sketches - but really I'm only just starting work on it.\n\nThis is also my first serious Node.js app, running on IBM's BlueMix"
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/b8lvi"
                    }],
                    "gsx$name": {
                        "$t": "ProfileWords"
                    },
                    "gsx$overview": {
                        "$t": "Identity analysis via twitter. Using follower data to explore the personality of Twitter accounts in a visual way."
                    },
                    "gsx$thumbnail": {
                        "$t": "profilewords.png"
                    },
                    "gsx$languages": {
                        "$t": "HTML5"
                    },
                    "gsx$goal": {
                        "$t": "An insightful, and easy way to find out more about the followers of a given twitter user. Wanted to understand why people followed - what was common to the followers. Wanted to learn how to enliven that data. More ideas and visualizations to come."
                    },
                    "gsx$client": {
                        "$t": "A personal project"
                    },
                    "gsx$view": {
                        "$t": "profile.png"
                    },
                    "gsx$website": {
                        "$t": "http://www.profilewords.com"
                    },
                    "gsx$repo": {
                        "$t": "https://hub.jazz.net/project/antonm/profiles/overview"
                    },
                    "gsx$tech": {
                        "$t": "* HTML5\n* Node.js\n* BlueMix\n* D3\n* Mongo Database\n* Twitter API\n* IBM Cloud"
                    },
                    "gsx$story": {
                        "$t": "Twitter fascinates the heck out of me. I think the thing that I find most intriguing right now is what unitess the followers of a given twitter user - in particular for my research in designing and using what I work on in my day job.\n\nThis is a new project that I've just started working on, and I have a mental model of what it is that I'm looking for and a few sketches - but really I'm only just starting work on it.\n\nThis is also my first serious Node.js app, running on IBM's BlueMix"
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/c23sb"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "Cardinals"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: A responsive web app experiment to find out more about the cardinals in the conclave - candidates to be the new Pope., thumbnail: cardinals.png, languages: HTML5, goal: To plot the cardinals on the map in a clean, simple and interesting way. \n\nTo understand where the cardinals lived, to use Twitter to find out what people were saying about them. \n\nTo have a geographical way of learning about the next leader of the Catholic Church., client: A personal project, view: cardinals.png, website: http://www.hickory.ca/cardinals/, repo: https://github.com/antonmc/sheetmap, tech: * HTML5\n* Google Maps API\n* Google Data API, story: During the election of the last pope, I was interested to know where all the cardinals came from - to understand where the next pope could come from. I couldn't find a map anywhere to show me the information.\n\nI used this experiment as a way to introduce programming to my early teenage son. He researched the candidates and built up a spreadsheet, geo-coded the coordinates and helped program the map.\n\nWe worked to seed the url of the map in comments about the papal election, and gor over 1000 hits in the first couple of days - each hit spending an average of 3 minutes on the page - poking around. It still gets hits. \n\nIt took 3 hours for us to develop, when we had the data. Again this app is fueled by a Google Spreadsheet."
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/c23sb"
                    }],
                    "gsx$name": {
                        "$t": "Cardinals"
                    },
                    "gsx$overview": {
                        "$t": "A responsive web app experiment to find out more about the cardinals in the conclave - candidates to be the new Pope."
                    },
                    "gsx$thumbnail": {
                        "$t": "cardinals.png"
                    },
                    "gsx$languages": {
                        "$t": "HTML5"
                    },
                    "gsx$goal": {
                        "$t": "To plot the cardinals on the map in a clean, simple and interesting way. \n\nTo understand where the cardinals lived, to use Twitter to find out what people were saying about them. \n\nTo have a geographical way of learning about the next leader of the Catholic Church."
                    },
                    "gsx$client": {
                        "$t": "A personal project"
                    },
                    "gsx$view": {
                        "$t": "cardinals.png"
                    },
                    "gsx$website": {
                        "$t": "http://www.hickory.ca/cardinals/"
                    },
                    "gsx$repo": {
                        "$t": "https://github.com/antonmc/sheetmap"
                    },
                    "gsx$tech": {
                        "$t": "* HTML5\n* Google Maps API\n* Google Data API"
                    },
                    "gsx$story": {
                        "$t": "During the election of the last pope, I was interested to know where all the cardinals came from - to understand where the next pope could come from. I couldn't find a map anywhere to show me the information.\n\nI used this experiment as a way to introduce programming to my early teenage son. He researched the candidates and built up a spreadsheet, geo-coded the coordinates and helped program the map.\n\nWe worked to seed the url of the map in comments about the papal election, and gor over 1000 hits in the first couple of days - each hit spending an average of 3 minutes on the page - poking around. It still gets hits. \n\nIt took 3 hours for us to develop, when we had the data. Again this app is fueled by a Google Spreadsheet."
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/cpzh4"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "TimeLine"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: An interactive visual timeline experiment., thumbnail: timeline.png, languages: HTML5, goal: To create a touch ready timeline that was responsive, clear and essential.\n\nI'd fallen for Visio timelines when I was managing projects. I wanted to learn HTML 5 Canvas, so I created this mostly in one day at a hackathon.\n\nI still dream of having a working, iPad version of this., client: A personal project, view: clockplot.png, repo: https://code.google.com/p/eventline/, tech: * HTML5 Canvas \n* Google Cloud, story: This was a project for a hackathon, where the goal was to learn more about HTML5. I chose to learn HTML5 Canvas, which later helped me in my work at IBM.\n\nMy vision for this app was to be able to take any time based data source and show it on an interactive timeline as a way of researching, searching etc. So make a youtube search that way, an email search or Twitter search. I'd still love to be able to do this. \n\nI think this project also wraps up a lot of my own design aspirations - to make the timeline be almost everything - very little user interface around it - clean and fuss free.\n\nOne day I'll come back to this ... that's what I keep telling myself ;)"
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/cpzh4"
                    }],
                    "gsx$name": {
                        "$t": "TimeLine"
                    },
                    "gsx$overview": {
                        "$t": "An interactive visual timeline experiment."
                    },
                    "gsx$thumbnail": {
                        "$t": "timeline.png"
                    },
                    "gsx$languages": {
                        "$t": "HTML5"
                    },
                    "gsx$goal": {
                        "$t": "To create a touch ready timeline that was responsive, clear and essential.\n\nI'd fallen for Visio timelines when I was managing projects. I wanted to learn HTML 5 Canvas, so I created this mostly in one day at a hackathon.\n\nI still dream of having a working, iPad version of this."
                    },
                    "gsx$client": {
                        "$t": "A personal project"
                    },
                    "gsx$view": {
                        "$t": "clockplot.png"
                    },
                    "gsx$website": {
                        "$t": ""
                    },
                    "gsx$repo": {
                        "$t": "https://code.google.com/p/eventline/"
                    },
                    "gsx$tech": {
                        "$t": "* HTML5 Canvas \n* Google Cloud"
                    },
                    "gsx$story": {
                        "$t": "This was a project for a hackathon, where the goal was to learn more about HTML5. I chose to learn HTML5 Canvas, which later helped me in my work at IBM.\n\nMy vision for this app was to be able to take any time based data source and show it on an interactive timeline as a way of researching, searching etc. So make a youtube search that way, an email search or Twitter search. I'd still love to be able to do this. \n\nI think this project also wraps up a lot of my own design aspirations - to make the timeline be almost everything - very little user interface around it - clean and fuss free.\n\nOne day I'll come back to this ... that's what I keep telling myself ;)"
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/cre1l"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "ShelterBox"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: A mobile app to tell the story of world crisis through acts of response to them, thumbnail: shelterbox.png, languages: iOS8, goal: The design goal was to imagine a fresh, mobile and connected way to recount the news of global crisis events ( earthquakes, tsunamis, conflict etc ).\n\nThis meant creating a server for the data, as well as the iOS client software. It required a lot of focus to learn how to make iOS apps, as well as to learn how to serve the data well, and groom the data., client: ShelterBox, view: shelterbox.png, website: http://www.hickory.ca/pages/shelterbox.html, repo: https://hub.jazz.net/project/antonm/sbclient/overview, tech: * iOS Storyboards, Autoflow\n* iOS Core Data\n* iOS MapKit\n* Node.js\n* Twitter API \n* IBM Cloud API\n* Wikipedia\n, story: A labour of love, and one of the things that I'm proudest of in my life. \n\nThis is ultimately what I would do with my time if I was independently wealthy - I would research, design and develop software solutions that disect, prize apart and present data stories of crisis responses from the different points of view. I would find new ways to show the stories, and push more and more to connect the dots through social media - idealistically to draw acts of charity together.\n\nI'm working on a detailed blog article to explain why I think projects like this matter."
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/cre1l"
                    }],
                    "gsx$name": {
                        "$t": "ShelterBox"
                    },
                    "gsx$overview": {
                        "$t": "A mobile app to tell the story of world crisis through acts of response to them"
                    },
                    "gsx$thumbnail": {
                        "$t": "shelterbox.png"
                    },
                    "gsx$languages": {
                        "$t": "iOS8"
                    },
                    "gsx$goal": {
                        "$t": "The design goal was to imagine a fresh, mobile and connected way to recount the news of global crisis events ( earthquakes, tsunamis, conflict etc ).\n\nThis meant creating a server for the data, as well as the iOS client software. It required a lot of focus to learn how to make iOS apps, as well as to learn how to serve the data well, and groom the data."
                    },
                    "gsx$client": {
                        "$t": "ShelterBox"
                    },
                    "gsx$view": {
                        "$t": "shelterbox.png"
                    },
                    "gsx$website": {
                        "$t": "http://www.hickory.ca/pages/shelterbox.html"
                    },
                    "gsx$repo": {
                        "$t": "https://hub.jazz.net/project/antonm/sbclient/overview"
                    },
                    "gsx$tech": {
                        "$t": "* iOS Storyboards, Autoflow\n* iOS Core Data\n* iOS MapKit\n* Node.js\n* Twitter API \n* IBM Cloud API\n* Wikipedia\n"
                    },
                    "gsx$story": {
                        "$t": "A labour of love, and one of the things that I'm proudest of in my life. \n\nThis is ultimately what I would do with my time if I was independently wealthy - I would research, design and develop software solutions that disect, prize apart and present data stories of crisis responses from the different points of view."
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/bl8zb"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "TeamBuilder"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: A working machine learning experiment to organize community soccer teams. It didn't start out that way - but the idea took control. , thumbnail: teambuilder.png, languages: Adobe Flex, goal: To automate the organization of community soccer for kids in a city.\n\nTo ease the process of finding a nearby team for young children to play on each season. I wanted to use algorithms for gathering kids near each other to form teams. \n\nWhen I was little this happened organically. These days, everything needs organizing - but this experiment really gave me a glimpse into the potential for data to give back., client: Kanata Soccer, view: teambuilder.png, website: http://squadbuilder.appspot.com/, tech: * Adobe Flex \n* Google App Engine\n* Google Maps API\n* Google Data API, story: When my sons were little I was involved in the local soccer club, coaching and convening. Each season we would take hundreds of registrants and find teams for them.\n\nIt was time consuming to manually see where the soccer players lived, their skill levels etc and group them in nearby appropriate teams.\n\nThe soccer club sent excel spreadsheets with the kids information. I imported them into Google docs, then used Google APIs to pull the data into a program that plotted the kids on a map, and ran an algorithm on them to sort them into teams.\n\nThis turned a 4 hour job into a 1 minute job. \n\nThe exciting thing for me ( which we never did ) was the idea that we could have completely made this be self organizing. Teams could have begun assembling themself at registration time - each time a registrant is added, the algorithm could run - at any day we could see a bunch of teams that could meet.\n\nWhich is the way I hope things turn out in the internet of things. "
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/bl8zb"
                    }],
                    "gsx$name": {
                        "$t": "TeamBuilder"
                    },
                    "gsx$overview": {
                        "$t": "A working machine learning experiment to organize community soccer teams. It didn't start out that way - but the idea took control. "
                    },
                    "gsx$thumbnail": {
                        "$t": "teambuilder.png"
                    },
                    "gsx$languages": {
                        "$t": "Adobe Flex"
                    },
                    "gsx$goal": {
                        "$t": "To automate the organization of community soccer for kids in a city.\n\nTo ease the process of finding a nearby team for young children to play on each season. I wanted to use algorithms for gathering kids near each other to form teams. \n\nWhen I was little this happened organically. These days, everything needs organizing - but this experiment really gave me a glimpse into the potential for data to give back."
                    },
                    "gsx$client": {
                        "$t": "Kanata Soccer"
                    },
                    "gsx$view": {
                        "$t": "teambuilder.png"
                    },
                    "gsx$website": {
                        "$t": "http://squadbuilder.appspot.com/"
                    },
                    "gsx$repo": {
                        "$t": ""
                    },
                    "gsx$tech": {
                        "$t": "* Adobe Flex \n* Google App Engine\n* Google Maps API\n* Google Data API"
                    },
                    "gsx$story": {
                        "$t": "When my sons were little I was involved in the local soccer club, coaching and convening. Each season we would take hundreds of registrants and find teams for them.\n\nIt was time consuming to manually see where the soccer players lived, their skill levels etc and group them in nearby appropriate teams.\n\nThe soccer club sent excel spreadsheets with the kids information. I imported them into Google docs, then used Google APIs to pull the data into a program that plotted the kids on a map, and ran an algorithm on them to sort them into teams.\n\nThis turned a 4 hour job into a 1 minute job. \n\nThe exciting thing for me ( which we never did ) was the idea that we could have completely made this be self organizing. Teams could have begun assembling themself at registration time - each time a registrant is added, the algorithm could run - at any day we could see a bunch of teams that could meet.\n\nWhich is the way I hope things turn out in the internet of things. "
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/c0p7u"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "Icons"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: A project to develop font icons and add them to the Orion Web IDE., thumbnail: icons.png, languages: CSS, goal: Crisp, simple monotone font icons - with identifiable metaphors and a clear representation even at 16px. \n\nThe icons needed to work at 16px size. They needed to be a font, so that we could style them and scale them to whatever size we wanted.\n\nI use these icons for lots of projects now, and in creating wireframes., client: IBM, view: orionfont.png, website: http://git.eclipse.org/c/orion/org.eclipse.orion.design.git/plain/icons/icons.html, repo: http://git.eclipse.org/c/orion/org.eclipse.orion.design.git/tree/icons/icons.html, tech: * Adobe Illustrator\n* Glyphs, story: When I joined the Orion project the icons were yellow on white - the contrast was not great, the style was way out of whack with the trend of monotone icons in the wider world.\n\nI was unable to affect change from the busy corporate design team to create new vector based icons for our small start-up project. The best they could do was repaint the yellow ones black and white, which was at least a step forward for us.\n\nI felt so strongly that I took training in Adobe Illustrator, drew, and redrew the icons until I felt confident that they could work, and learned how to make vector based fonts.\n\nFor the most part I did this in my spare time, and the training was at my own expense. Illustrator is my go to tool for most visual work that I do, so the training and eperience were incredibly valuable."
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/c0p7u"
                    }],
                    "gsx$name": {
                        "$t": "Icons"
                    },
                    "gsx$overview": {
                        "$t": "A project to develop font icons and add them to the Orion Web IDE."
                    },
                    "gsx$thumbnail": {
                        "$t": "icons.png"
                    },
                    "gsx$languages": {
                        "$t": "CSS"
                    },
                    "gsx$goal": {
                        "$t": "Crisp, simple monotone font icons - with identifiable metaphors and a clear representation even at 16px. \n\nThe icons needed to work at 16px size. They needed to be a font, so that we could style them and scale them to whatever size we wanted.\n\nI use these icons for lots of projects now, and in creating wireframes."
                    },
                    "gsx$client": {
                        "$t": "IBM"
                    },
                    "gsx$view": {
                        "$t": "orionfont.png"
                    },
                    "gsx$website": {
                        "$t": "http://git.eclipse.org/c/orion/org.eclipse.orion.design.git/plain/icons/icons.html"
                    },
                    "gsx$repo": {
                        "$t": "http://git.eclipse.org/c/orion/org.eclipse.orion.design.git/tree/icons/icons.html"
                    },
                    "gsx$tech": {
                        "$t": "* Adobe Illustrator\n* Glyphs"
                    },
                    "gsx$story": {
                        "$t": "When I joined the Orion project the icons were yellow on white - the contrast was not great, the style was way out of whack with the trend of monotone icons in the wider world.\n\nI was unable to affect change from the busy corporate design team to create new vector based icons for our small start-up project. The best they could do was repaint the yellow ones black and white, which was at least a step forward for us.\n\nI felt so strongly that I took training in Adobe Illustrator, drew, and redrew the icons until I felt confident that they could work, and learned how to make vector based fonts.\n\nFor the most part I did this in my spare time, and the training was at my own expense. Illustrator is my go to tool for most visual work that I do, so the training and eperience were incredibly valuable."
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/bpgoi"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "Cultura"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: An online store for a language school, thumbnail: culturathumb.png, languages: HTML5, goal: To create a clear efficient online store for language classes, that was as easy for the owner to update as it was for a client to use.\n\nAs with many of my projects, I data drove this project from a model of the data that would be needed by the page. I used Google Spreadsheets to stroe the data and fuel the app, through a data API.\n\nIt meant the store owner only had to change the spreadsheet data to affect change on the page., client: Cultura Espanola, view: cultura.png, website: http://www.culturaespanola.ca/store, tech: * HTML5\n* Bootstrap \n* PayPal API\n* Google Data API, story: In exchange for some Spanish lessons, I worked with the school to create a store for them. The store content is driven from Google Spreadsheets, which makes it really simple to maintain and update - no programming is needed by the school owners.\n\nHaving looked at Spanish schools for lessons, I had an idea of what I wanted to see in a website experience for finding the right lesson, the right school.\n\nI figure if the registration experience is clean, simple, and relevant, then the culture of the school will give clean, simple, relevant education.\n\nSo the system is one that I'm proud of - built around the data structure of the lessons, modeled in Google SpreadSheets. The spreadsheet creates a structure, and forces the school to think about their content - and offers a foundation of simplicity for programming using the content data."
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/bpgoi"
                    }],
                    "gsx$name": {
                        "$t": "Cultura"
                    },
                    "gsx$overview": {
                        "$t": "An online store for a language school"
                    },
                    "gsx$thumbnail": {
                        "$t": "culturathumb.png"
                    },
                    "gsx$languages": {
                        "$t": "HTML5"
                    },
                    "gsx$goal": {
                        "$t": "To create a clear efficient online store for language classes, that was as easy for the owner to update as it was for a client to use.\n\nAs with many of my projects, I data drove this project from a model of the data that would be needed by the page. I used Google Spreadsheets to stroe the data and fuel the app, through a data API.\n\nIt meant the store owner only had to change the spreadsheet data to affect change on the page."
                    },
                    "gsx$client": {
                        "$t": "Cultura Espanola"
                    },
                    "gsx$view": {
                        "$t": "cultura.png"
                    },
                    "gsx$website": {
                        "$t": "http://www.culturaespanola.ca/store"
                    },
                    "gsx$repo": {
                        "$t": ""
                    },
                    "gsx$tech": {
                        "$t": "* HTML5\n* Bootstrap \n* PayPal API\n* Google Data API"
                    },
                    "gsx$story": {
                        "$t": "In exchange for some Spanish lessons, I worked with the school to create a store for them. The store content is driven from Google Spreadsheets, which makes it really simple to maintain and update - no programming is needed by the school owners.\n\nHaving looked at Spanish schools for lessons, I had an idea of what I wanted to see in a website experience for finding the right lesson, the right school.\n\nI figure if the registration experience is clean, simple, and relevant, then the culture of the school will give clean, simple, relevant education.\n\nSo the system is one that I'm proud of - built around the data structure of the lessons, modeled in Google SpreadSheets. The spreadsheet creates a structure, and forces the school to think about their content - and offers a foundation of simplicity for programming using the content data."
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/c3ico"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "JazzHub IDE"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: How to offer a web based programming tool., thumbnail: jazzhubthumb.png, languages: HTML5, goal: To design a lightweight, contemporary and effective code editing experience in 'the cloud'.\n\nAs time progresses I believe that we'll use web browsers to program more things. This is an ambitious project to use browsers for creating web apps and pages., client: IBM, view: jazzhub.png, website: http://hub.jazz.net, repo: http://git.eclipse.org/c/orion/org.eclipse.orion.client.git/tree/, tech: * HTML5\n* Illustrator\n* CSS3\n* Patience ;), story: For the past couple of years my work has focused on leading the user interface development for a web based software development tool.\n\nFor the mostpart I've implemented HTML, JS, and CSS changes, but in the past year I lead user experience - hungrily gathering feedback from users, involving them, and pushing the team for changes that they say they want. \n\nI've helped transform the IDE from a narrowly focused restful page app, to a tool that most developers would understand because it is equipped with the strucutre they're used to seeing - but at the same time, the IDE tries hard to maximize the space in the browser page, by only offering what is essential.\n\nThis IDE has been absorbed in products from HP, SAP, Pivotal, Mozilla and IBM"
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/c3ico"
                    }],
                    "gsx$name": {
                        "$t": "JazzHub IDE"
                    },
                    "gsx$overview": {
                        "$t": "How to offer a web based programming tool."
                    },
                    "gsx$thumbnail": {
                        "$t": "jazzhubthumb.png"
                    },
                    "gsx$languages": {
                        "$t": "HTML5"
                    },
                    "gsx$goal": {
                        "$t": "To design a lightweight, contemporary and effective code editing experience in 'the cloud'.\n\nAs time progresses I believe that we'll use web browsers to program more things. This is an ambitious project to use browsers for creating web apps and pages."
                    },
                    "gsx$client": {
                        "$t": "IBM"
                    },
                    "gsx$view": {
                        "$t": "jazzhub.png"
                    },
                    "gsx$website": {
                        "$t": "http://hub.jazz.net"
                    },
                    "gsx$repo": {
                        "$t": "http://git.eclipse.org/c/orion/org.eclipse.orion.client.git/tree/"
                    },
                    "gsx$tech": {
                        "$t": "* HTML5\n* Illustrator\n* CSS3\n* Patience ;)"
                    },
                    "gsx$story": {
                        "$t": "For the past couple of years my work has focused on leading the user interface development for a web based software development tool.\n\nFor the mostpart I've implemented HTML, JS, and CSS changes, but in the past year I lead user experience - hungrily gathering feedback from users, involving them, and pushing the team for changes that they say they want. \n\nI've helped transform the IDE from a narrowly focused restful page app, to a tool that most developers would understand because it is equipped with the strucutre they're used to seeing - but at the same time, the IDE tries hard to maximize the space in the browser page, by only offering what is essential.\n\nThis IDE has been absorbed in products from HP, SAP, Pivotal, Mozilla and IBM"
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/bo245"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "Campaigner"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: A hackathon project with Amnesty Canada, to explore options for cheaper and more efficient campaigns, thumbnail: amnesty.png, languages: HTML5, goal: To use mobile technology to offer a gentle, inobtrusive, simple way of gathering signitures for a campaign.\n\nThis was a hackathon project - where we imagined a data driven way of managing campains for signatures., client: Amnesty Interational, view: amnesty-screens.png, repo: https://github.com/pickle27/campaigner, tech: * Ruby on Rails \n* HTML5\n* Adobe Illustrator, story: A hackathon where I was able to work with a charity that I hugely admire - Amnesty International. This was a Random Hackos Of Kindness hackathon at Shopify in Ottawa and was probably the best experience I've had a hackathon.\n\nI took a design lead role and worked a person centric design around the interested parties in a campaign - people signing, the campaign lead, the recipients, the person campaigning in the streets.\n\nWe developed this as a system - where there was a restful api for the campaign that could be used with different web and mobile front ends.\n\n"
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/bo245"
                    }],
                    "gsx$name": {
                        "$t": "Campaigner"
                    },
                    "gsx$overview": {
                        "$t": "A hackathon project with Amnesty Canada, to explore options for cheaper and more efficient campaigns"
                    },
                    "gsx$thumbnail": {
                        "$t": "amnesty.png"
                    },
                    "gsx$languages": {
                        "$t": "HTML5"
                    },
                    "gsx$goal": {
                        "$t": "To use mobile technology to offer a gentle, inobtrusive, simple way of gathering signitures for a campaign.\n\nThis was a hackathon project - where we imagined a data driven way of managing campains for signatures."
                    },
                    "gsx$client": {
                        "$t": "Amnesty Interational"
                    },
                    "gsx$view": {
                        "$t": "amnesty-screens.png"
                    },
                    "gsx$website": {
                        "$t": ""
                    },
                    "gsx$repo": {
                        "$t": "https://github.com/pickle27/campaigner"
                    },
                    "gsx$tech": {
                        "$t": "* Ruby on Rails \n* HTML5\n* Adobe Illustrator"
                    },
                    "gsx$story": {
                        "$t": "A hackathon where I was able to work with a charity that I hugely admire - Amnesty International. This was a Random Hackos Of Kindness hackathon at Shopify in Ottawa and was probably the best experience I've had a hackathon.\n\nI took a design lead role and worked a person centric design around the interested parties in a campaign - people signing, the campaign lead, the recipients, the person campaigning in the streets.\n\nWe developed this as a system - where there was a restful api for the campaign that could be used with different web and mobile front ends.\n\n"
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/cyevm"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "DesignManager"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: A sketching tool on the web, thumbnail: dmthumb.png, languages: HTML5, goal: Wanted to easiliy allow software developers to communicate development ideas visually, by sketching comments on software designs.\n\nThis was used for reviwing design documents. I think it was a little ahead of it's time, and I wish that the technology had been used to annotate any web page - not just the images that were held in the design docs., client: IBM, view: dm.png, website: https://jazz.net/products/design-management/, tech: * HTML5 Canvas \n* Java, story: IBM Rational Software Architect was a desktop app that allowed developers to design software systems using UML. This was a project to surface those designs on the web, and allow developers to visually comment.\n\nMy job was to design and develop the online sketching software. \n\nMy approach was to make it as incidental as possible - to allow easy discovery, but keep the drawing tools to the periphery so that the canvas was the design they were drawing on, almost like it was a window on top of the design.\n\nI developed an iPad version too, that we could use our fingers on."
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/cyevm"
                    }],
                    "gsx$name": {
                        "$t": "DesignManager"
                    },
                    "gsx$overview": {
                        "$t": "A sketching tool on the web"
                    },
                    "gsx$thumbnail": {
                        "$t": "dmthumb.png"
                    },
                    "gsx$languages": {
                        "$t": "HTML5"
                    },
                    "gsx$goal": {
                        "$t": "Wanted to easiliy allow software developers to communicate development ideas visually, by sketching comments on software designs.\n\nThis was used for reviwing design documents. I think it was a little ahead of it's time, and I wish that the technology had been used to annotate any web page - not just the images that were held in the design docs."
                    },
                    "gsx$client": {
                        "$t": "IBM"
                    },
                    "gsx$view": {
                        "$t": "dm.png"
                    },
                    "gsx$website": {
                        "$t": "https://jazz.net/products/design-management/"
                    },
                    "gsx$repo": {
                        "$t": ""
                    },
                    "gsx$tech": {
                        "$t": "* HTML5 Canvas \n* Java"
                    },
                    "gsx$story": {
                        "$t": "IBM Rational Software Architect was a desktop app that allowed developers to design software systems using UML. This was a project to surface those designs on the web, and allow developers to visually comment.\n\nMy job was to design and develop the online sketching software. \n\nMy approach was to make it as incidental as possible - to allow easy discovery, but keep the drawing tools to the periphery so that the canvas was the design they were drawing on, almost like it was a window on top of the design.\n\nI developed an iPad version too, that we could use our fingers on."
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/cztg3"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "Picker"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: Creating a programming color scheme, thumbnail: colorpicker.png, languages: HTML5, goal: To offer an appealing, easy, visual way of building a syntax color scheme for a code editor.\n\nProgrammers like to be able to style their editors - this was my take on doing that visually., client: IBM, view: themebuilder.png, website: http://orionhub.org, repo: http://git.eclipse.org/c/orion/org.eclipse.orion.client.git/tree/, tech: * HTML5 Canvas, story: My dream was to offer a visual snapshot of how a code editor looked, but allow a person to click on parts of it to visually change the color of different parts.\n\nIt was a nice exercise to work through - it's a tricky problem to solve - it is hard to visualize a potential color scheme if you were setting colors in a static settings form - I wanted this to be visual, and interactive."
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/cztg3"
                    }],
                    "gsx$name": {
                        "$t": "Picker"
                    },
                    "gsx$overview": {
                        "$t": "Creating a programming color scheme"
                    },
                    "gsx$thumbnail": {
                        "$t": "colorpicker.png"
                    },
                    "gsx$languages": {
                        "$t": "HTML5"
                    },
                    "gsx$goal": {
                        "$t": "To offer an appealing, easy, visual way of building a syntax color scheme for a code editor.\n\nProgrammers like to be able to style their editors - this was my take on doing that visually."
                    },
                    "gsx$client": {
                        "$t": "IBM"
                    },
                    "gsx$view": {
                        "$t": "themebuilder.png"
                    },
                    "gsx$website": {
                        "$t": "http://orionhub.org"
                    },
                    "gsx$repo": {
                        "$t": "http://git.eclipse.org/c/orion/org.eclipse.orion.client.git/tree/"
                    },
                    "gsx$tech": {
                        "$t": "* HTML5 Canvas"
                    },
                    "gsx$story": {
                        "$t": "My dream was to offer a visual snapshot of how a code editor looked, but allow a person to click on parts of it to visually change the color of different parts.\n\nIt was a nice exercise to work through - it's a tricky problem to solve - it is hard to visualize a potential color scheme if you were setting colors in a static settings form - I wanted this to be visual, and interactive."
                    }
                }, {
                    "id": {
                        "$t": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/cssly"
                    },
                    "updated": {
                        "$t": "2014-11-02T23:14:54.911Z"
                    },
                    "category": [{
                        "scheme": "http://schemas.google.com/spreadsheets/2006",
                        "term": "http://schemas.google.com/spreadsheets/2006#list"
                    }],
                    "title": {
                        "type": "text",
                        "$t": "OrionCover"
                    },
                    "content": {
                        "type": "text",
                        "$t": "overview: Developing a new landing page for OrionHub, thumbnail: orioncover.png, languages: HTML5, goal: Creating a simple, responating responsive cover page, client: IBM, view: hero-image.png, tech: * Illustrator \n* CSS3, story: Working on this ... coming soon ..."
                    },
                    "link": [{
                        "rel": "self",
                        "type": "application/atom+xml",
                        "href": "https://spreadsheets.google.com/feeds/list/0AhLgoEUzhCg_dC1UTU9OZnh1QTlyX3V6clJpNmtxUWc/od6/public/values/cssly"
                    }],
                    "gsx$name": {
                        "$t": "OrionCover"
                    },
                    "gsx$overview": {
                        "$t": "Developing a new landing page for OrionHub"
                    },
                    "gsx$thumbnail": {
                        "$t": "orioncover.png"
                    },
                    "gsx$languages": {
                        "$t": "HTML5"
                    },
                    "gsx$goal": {
                        "$t": "Creating a simple, responating responsive cover page"
                    },
                    "gsx$client": {
                        "$t": "IBM"
                    },
                    "gsx$view": {
                        "$t": "hero-image.png"
                    },
                    "gsx$website": {
                        "$t": ""
                    },
                    "gsx$repo": {
                        "$t": ""
                    },
                    "gsx$tech": {
                        "$t": "* Illustrator \n* CSS3"
                    },
                    "gsx$story": {
                        "$t": "Working on this ... coming soon ..."
                    }
                }]
            }
        }
    }
}